# coping: utf-8

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.
 
number = input('Введите число ') 
print(max(number)) 



# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

a = input("Введите первое число: ")
b = input("Введите второе число: ")
a, b = b, a
print("Первое число: ", a)
print("Второе число: ", b)


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax2 + ьх + с = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# импорт математике
# математика.sqrt(4) - вычисляет корень числа 4

while True:
    a = int(input("Введите коэффициент a: "))
    if a == 0:
        print("Это не будет квадратичным уравнением, \
               пожалуйста, введите другое число для коэффициента a.")
        continue
    else:
        break
b = int(input("Введите коэффициент b: "))
c = int(input("Введите коэффициент c: "))

# calculating discriminant
d = (b ** 2) - (4 * a * c)

# calculating roots
if d < 0:
    print("Это уравнение не имеет решения.")

elif d == 0:
    x = (-b + math.sqrt(d)) / (2 * a)
    print("Это уравнение имеет два решения: ", x)

else:
    x1 = (-b + math.sqrt(d)) / (2 * a)
    x2 = (-b - math.sqrt(d)) / (2 * a)
    print("Это уравнение имеет два решения: ", x1, " and", x2)



